# Напишите программу, которая принимает на вход вещественное число и показывает сумму его цифр.
# Пример:
# - 6782 -> 23
# - 0,56 -> 11

# x = int(input("Введите число: "))

# sum = 0
# while (x != 0):
#     sum = sum + x%10
#     x = x // 10
# print("Сумма цифр числа равна: ", sum)    


# Напишите программу, которая принимает на вход число N и выдает набор произведений чисел от 1 до N.
# Пример:
# - пусть N = 4, тогда [ 1, 2, 6, 24 ] (1, 1*2, 1*2*3, 1*2*3*4)

# x = int(input("Введите число: "))

# import math
# f = math.factorial(x)
# print(f)
 
# def fact(x):
#     f = 1
#     for i in range(x):
#         f *= i+1
#     return f
 
# f = fact(x)
# print(f)
