#Задайте список. Напишите программу, которая определит, присутствует ли в заданном списке строк некое число.

# musics = ["AC/DC", "System of a down", "Deep purple", "4", "Disturbed", "LOUNA", "Ozzy Osbourne"]

# x=input("Введите искомое число ")

                           
# if x in musics:
#     print("число имеется")
# else:
#     print("такого числа нет")


#Напишите программу, которая определит позицию второго вхождения строки в списке либо сообщит, что её нет.

# x = input("Введите строку: ")

# if x.count("f") == 1:
#     print(-1)
# elif x.count("f") < 1:
#     print("нет вхождений")    
# else:
#     print(x.find("f",x.find("f") + 1))


